## Pandas Merge concat

1. concat

- `pd.concat([데이터프레임_리스트], axis=방향, ignore_index=True/False)`
- 위아래나 양옆으로 합치기
- 기본값 axis=0, 위아래로 쌓기(수직으로 쌓기)
- ignore_index : 인덱스 재설정 가능

2. merge

- 양쪽 테이블에 있는 공통된 key를 기준으로 데이터 합친다.
- `pd.merge(왼쪽, 오른쪽, on='기준컬럼', how='조인방식')`

In [1]:
import pandas as pd

In [2]:
jan = pd.DataFrame({
    'month': ['Jan', 'Jan'],
    'store': ['A', 'B'],
    'sales': [100, 150]
})

feb = pd.DataFrame({
    'month': ['Feb', 'Feb'],
    'store': ['A', 'B'],
    'sales': [120, 130]
})

In [3]:
jan

  month store  sales
0   Jan     A    100
1   Jan     B    150

In [4]:
feb

  month store  sales
0   Feb     A    120
1   Feb     B    130

In [5]:
result = pd.concat([jan, feb], ignore_index=True)
result

  month store  sales
0   Jan     A    100
1   Jan     B    150
2   Feb     A    120
3   Feb     B    130

In [6]:
# axis 1

In [7]:
names = pd.DataFrame({
    'name': ['Kim', 'Lee', 'Park']
})

ages = pd.DataFrame({
    'age': [24, 30, 28]
})

In [8]:
names

   name
0   Kim
1   Lee
2  Park

In [9]:
ages

   age
0   24
1   30
2   28

In [10]:
result=pd.concat([names,ages],axis=1)
result

   name  age
0   Kim   24
1   Lee   30
2  Park   28

In [11]:
# 단, 행 개수가 안맞으면 NaN이 생긴다

In [12]:
names = pd.DataFrame({
    'name': ['Kim', 'Lee', 'Park','Nami']
})

ages = pd.DataFrame({
    'age': [24, 30, 28]
})

In [13]:
result=pd.concat([names,ages],axis=1)
result

   name   age
0   Kim  24.0
1   Lee  30.0
2  Park  28.0
3  Nami   NaN

In [14]:
#merge

In [15]:
customers = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Kim', 'Lee', 'Park']
})

orders = pd.DataFrame({
    'id': [1, 1, 3],
    'product': ['Apple', 'Banana', 'Cherry']
})

In [16]:
customers

   id  name
0   1   Kim
1   2   Lee
2   3  Park

In [17]:
orders

   id product
0   1   Apple
1   1  Banana
2   3  Cherry

In [18]:
# inner Join

In [19]:
merged=pd.merge(customers,orders,on='id',how='inner')
merged

   id  name product
0   1   Kim   Apple
1   1   Kim  Banana
2   3  Park  Cherry

In [23]:
# left Join
# 왼쪽 원본 유지, 오른쪽 정보 가져와 붙인다. 매칭 안되면 NaN

In [22]:
merged=pd.merge(customers,orders,on='id',how='left')
merged

   id  name product
0   1   Kim   Apple
1   1   Kim  Banana
2   2   Lee     NaN
3   3  Park  Cherry

In [24]:
# Right Join
# 오른쪽 원본 유지, 왼쪽 정보를 가져와 붙인다 매칭 안되면 NaN

In [28]:
merged_right = pd.merge(customers, orders, on='id', how='right')
merged

   id  name product
0   1   Kim   Apple
1   1   Kim  Banana
2   2   Lee     NaN
3   3  Park  Cherry

In [29]:
# Outer Join 합집합
merged_outer =pd.merge(customers, orders, on='id', how='outer')
merged_outer

   id  name product
0   1   Kim   Apple
1   1   Kim  Banana
2   2   Lee     NaN
3   3  Park  Cherry

In [37]:
# 컬럼이름이 다를때 left_on, right_on
# 이름은 다르지만 같은 의미의 키일 때 사용

In [31]:
left_df = pd.DataFrame({
    'order_id': [101, 102, 103],
    'user_id': [1, 2, 4],
    'price': [3000, 1500, 2000]
})

right_df = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})

In [32]:
left_df

   order_id  user_id  price
0       101        1   3000
1       102        2   1500
2       103        4   2000

In [33]:
right_df

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie

In [36]:
# merge 실행 
result=pd.merge(
    left_df,
    right_df,
    left_on='user_id',
    right_on='id',
    how='left'
)
result

   order_id  user_id  price   id   name
0       101        1   3000  1.0  Alice
1       102        2   1500  2.0    Bob
2       103        4   2000  NaN    NaN